 

Step 2:Cofigure ip addres to all interfaces 
In Router R1,
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip address 10.0.0.1 255.0.0.0
Router(config-if)#no shutdown

Router(config)#interface serial 2/0
Router(config-if)#ip address 20.0.0.1 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown
In Router R2,
Router>enable
Router#config T
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 2/0
Router(config-if)#ip address 20.0.0.2 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown

Router(config)#interface serial 3/0
Router(config-if)#ip address 30.0.0.1 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown

In Router R3,
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 3/0
Router(config-if)#ip address 30.0.0.2 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown

Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 3/0
Router(config-if)#ip address 40.0.0.1 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown

In router R4,
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface serial 3/0
Router(config-if)#ip address 40.0.0.2 255.0.0.0
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown

Router(config)#interface fastEthernet 0/0
Router(config-if)#ip address 50.0.0.1 255.0.0.0
Router(config-if)#no shutdown

Step 3:Now,Enable ip routing by configuring ospf routing protocol in all routers,
 In Router R1, 
Router(config)#router ospf 1
Router(config-router)#router-id 1.1.1.1
Router(config-router)#network 10.0.0.0 0.255.255.255 area 2
Router(config-router)#network 20.0.0.0 0.255.255.255 area 1
Router(config-router)#exit

In Router R2,
Router(config)#router ospf 1
Router(config-router)#router-id 2.2.2.2
Router(config-router)#network 20.0.0.0 0.255.255.255 area 1
Router(config-router)#network 30.0.0.0 0.255.255.255 area 0
Router(config-router)#exit

In Router R3,
Router(config)#router ospf 1
Router(config-router)#router-id 3.3.3.3
Router(config-router)#network 30.0.0.0 0.255.255.255 area 0
Router(config-router)#network 40.0.0.0 0.255.255.255 area 3
Router(config-router)#exit

In Router R4,
Router(config)#router ospf 1
Router(config-router)#router-id 3.3.3.3
Router(config-router)#network 400.0.0.0 0.255.255.255 area 3
Router(config-router)#network 50.0.0.0 0.255.255.255 area 4
Router(config-router)#exit


Step 4:Now check routing table of R1,

Router#show ip route
Router>show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

C    10.0.0.0/8 is directly connected, FastEthernet0/0
     20.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       20.0.0.0/8 is directly connected, Serial2/0
C       20.0.0.2/32 is directly connected, Serial2/0
In router 1,
R1(config-if)#interface loopback 0
 R1(config-if)#ip add 172.16.1.252 255.255.0.0
 R1(config-if)#no shutdown 
In router 2,
R2(config-if)#interface loopback 0 
R2(config-if)#ip add 172.16.1.253 255.255.0.0
 R2(config-if)#no shutdown 
In router 3,
R3(config-if)#interface loopback 0
 R3(config-if)#ip add 172.16.1.254 255.255.0.0 
R3(config-if)#no shutdown
 In router 4,
R4(config-if)#interface loopback 0
 R4(config-if)#ip add 172.16.1.255 255.255.0.0 
R3(config-if)#no shutdown



Step 5:Now ,Check Routing table of R3,
Router>show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

O IA 10.0.0.0/8 [110/129] via 30.0.0.1, 00:05:03, Serial3/0
O IA 20.0.0.0/8 [110/128] via 30.0.0.1, 00:05:18, Serial3/0
     30.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       30.0.0.0/8 is directly connected, Serial3/0
C       30.0.0.1/32 is directly connected, Serial3/0
C    40.0.0.0/8 is directly connected, FastEthernet1/0Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP

Step 6:Create virtual link between R1,R2,by this we create a virtual link to connect area 3 to area 0.
In Router R1,
Router(config)#router ospf 1
Router(config-router)#area 1 virtual-link 2.2.2.2
Router(config-router)#exit

In Rotuer R2,
Router(config)#router ospf 1
Router(config-router)# area 1 virtual-link 1.1.1.1
Router(config-router)#exit

In Router R3,
Router(config)#router ospf 1
Router(config-router)#area 3 virtual-link 4.4.4.4
Router(config-router)#exit

In Rotuer R4,
Router(config)#router ospf 1
Router(config-router)# area 1 virtual-link 3.3.3.3
Router(config-router)#exit



Step 7:R2 and R3 get updates about Area 3 .Now,Check routing table of R3,
Router#show ip route
Router>show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

O IA 10.0.0.0/8 [110/129] via 30.0.0.1, 00:05:03, Serial3/0
O IA 20.0.0.0/8 [110/128] via 30.0.0.1, 00:05:18, Serial3/0
     30.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       30.0.0.0/8 is directly connected, Serial3/0
C       30.0.0.1/32 is directly connected, Serial3/0
C    40.0.0.0/8 is directly connected, FastEthernet1/0

Step 8:Check connectivity between host 10.0.0.10 to 50.0.0.10
PC>ping 50.0.0.10

Pinging 50.0.0.10 with 32 bytes of data:

Reply from 50.0.0.10: bytes=32 time=6ms TTL=124
Reply from 50.0.0.10: bytes=32 time=5ms TTL=124
Reply from 50.0.0.10: bytes=32 time=5ms TTL=124
Reply from 50.0.0.10: bytes=32 time=5ms TTL=124

Ping statistics for 50.0.0.10:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 5ms, Maximum = 6ms, Average = 5ms
